
class FondData {
  FondData({
    this.id = -1,
    this.imageUrl = '',
    this.fundName = '',
    this.amount = '',
    this.tag = '',
    this.description = '',
    this.contactInfo = '',
  });

  int id;
  String imageUrl;
  String fundName;
  String amount;
  String tag;
  String description;
  String contactInfo;

  static List<FondData> FondList = <FondData>[
    FondData(
      id: 0,
      imageUrl: 'assets/images/fond.png',
      fundName: 'Милосердие',
      amount: '525',
      tag: 'Социальная помощь',
      description: 'Фонд "Доброе сердце" создан для помощи людям, оказавшимся в трудной жизненной ситуации. Мы стремимся улучшить их жизнь, предоставляя материальную поддержку, социальные услуги и психологическую помощь.',
      contactInfo: 'Телефон: 8-800-555-35-35 \nАдрес: г.Москва, ул.Ленина, д.10 \nE-mail: 6xqg5@example.com',
    ),
    FondData(
      id: 1,
      imageUrl: 'assets/images/fond_zdrav.jpeg',
      fundName: 'ФондЗдрав',
      amount: '525',
      tag: 'Здравоохранение',
      description: 'Фонд "Доброе сердце" создан для помощи людям, оказавшимся в трудной жизненной ситуации. Мы стремимся улучшить их жизнь, предоставляя материальную поддержку, социальные услуги и психологическую помощь.',
      contactInfo: 'Телефон: 8-800-555-35-35 \nАдрес: г.Москва, ул.Ленина, д.10 \nE-mail: 6xqg5@example.com',
    ),
    FondData(
      id: 2,
      imageUrl: 'assets/images/fond_wwf.png',
      fundName: 'WWF',
      amount: '525',
      tag: 'Окружающая среда',
      description: 'Фонд "Доброе сердце" создан для помощи людям, оказавшимся в трудной жизненной ситуации. Мы стремимся улучшить их жизнь, предоставляя материальную поддержку, социальные услуги и психологическую помощь.',
      contactInfo: 'Телефон: 8-800-555-35-35 \nАдрес: г.Москва, ул.Ленина, д.10 \nE-mail: 6xqg5@example.com',
    ),
    FondData(
      id: 3,
      imageUrl: 'assets/images/fond_animals.png',
      fundName: 'Рука помощи',
      amount: '525',
      tag: 'Животные',
      description: 'Фонд "Доброе сердце" создан для помощи людям, оказавшимся в трудной жизненной ситуации. Мы стремимся улучшить их жизнь, предоставляя материальную поддержку, социальные услуги и психологическую помощь.',
      contactInfo: 'Телефон: 8-800-555-35-35 \nАдрес: г.Москва, ул.Ленина, д.10 \nE-mail: 6xqg5@example.com',
    ),
  ];
}


// Фонд "Доброе сердце" создан для помощи людям, оказавшимся в трудной жизненной ситуации. Мы стремимся улучшить их жизнь, предоставляя материальную поддержку, социальные услуги и психологическую помощь.
//
// Цели:
//
// Оказывать адресную материальную помощь нуждающимся семьям и одиноким людям.
// Развивать социальные программы для поддержки людей с ограниченными возможностями, детей-сирот и детей из неблагополучных семей.
// Оказывать психологическую помощь людям, пережившим стрессовые ситуации, травмы или потери.
// Содействовать развитию культуры благотворительности и волонтерства.
// Деятельность:
//
// Сбор и распределение средств, полученных от пожертвований и грантов.
// Реализация социальных программ, направленных на поддержку различных категорий нуждающихся людей.
// Предоставление психологической помощи и консультаций.
// Проведение благотворительных мероприятий и акций.
// Сотрудничество с государственными и некоммерческими организациями.
// Влияние:
//
// За время своей работы фонд "Доброе сердце" оказал помощь тысячам людей. Мы помогли нуждающимся семьям улучшить их материальное положение, детям-сиротам обрести дом и заботу, людям с ограниченными возможностями – социализироваться и найти свое место в жизни. Мы также внесли свой вклад в развитие культуры благотворительности и волонтерства в нашем регионе.
//
// Как помочь:
//
// Вы можете сделать пожертвование на расчетный счет фонда.
// Вы можете стать волонтером и помогать в реализации социальных программ.
// Вы можете пожертвовать вещи, продукты питания или лекарства.
// Вы можете распространять информацию о фонде и его деятельности.
// Вместе мы можем сделать мир добрее!